{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2016-2022",
      "school_name": "Toronto Metropolitan University (Formerly Ryerson University)"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ShahbazYousaf",
  "highlighted_projects": [
    {
      "description": "Developed a job recommender system achieving a 90% match rate. Used Python for NLP-based data preprocessing, reducing ML training time by 70%. Implemented a MySQL database for storing resumes and job descriptions. Created a user-friendly web app with Django for backend and React for frontend.",
      "git_url": "https://dreamy-gumdrop-71428a.netlify.app/",
      "name": "Machine Learning Driven Job Recommender System"
    },
    {
      "description": "Designed and implemented a 2021 NBA Season database using SQLite. Utilized ER Diagram for structure, inserted data, and implemented SQL queries. Developed a Java application using JDBC for database interaction. Created an XML version with an XML Schema and performed queries using XSLT.",
      "git_url": null,
      "name": "NBA Data Model and Database"
    },
    {
      "description": "Implemented Gradient Descent algorithm for predicting final marks based on midterm marks using student data. Compared standardized and non-standardized values, conducted exploratory data analysis, and adjusted learning rates and iterations for improved accuracy. Validation with scikit-learn library showed similar outcomes.",
      "git_url": null,
      "name": "Gradient Descent for Univariate Linear Regression"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Built an MVP for Jarvis' Linux Cluster Administration (LCA) team to manage a Linux CentOS 7 cluster of 10+ servers. The project records hardware specs, monitors real-time Linux server usage data and stores data in a PostgreSQL RDBMS for analytics and future resource planning. Developed bash scripts to collect hardware and server data collection, used Docker for PostgreSQL provisioning, and leveraged Git and GitHub for version control. Configured crontab to run host_usage.sh script every minute, streamlining data collection and regular server usage data collection and reporting.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_ShahbazYousaf/tree/master/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Developed a Java grep app mimicking Linux bash grep command, allowing users to search for matching strings in files. The application recursively searches a root directory based on a provided regex pattern, identifies matching lines, and saves them to a user-specified output file. Utilizing Docker, the app can be easily implemented by pulling the image from DockerHub. Technologies used in the project include Java, Maven, Intellij, Lambda \u0026 Stream API, and Docker.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_ShahbazYousaf/tree/master/core_java/grep",
      "name": "Java Grep Application"
    }
  ],
  "name": "Shahbaz Yousaf",
  "others": [
    {
      "bullets": [
        "IBM Data Science Professional Certificate (2022)",
        "IBM Applied DevOps Engineering Professional Certificate (2023)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Basketball: Play organized basketball as part of a local league",
        "Strength Training: Current PRS are 275 lbs bench press, 275 lbs squat, 405 lbs deadlift",
        "MMA: Train muay thai and wrestling",
        "Cooking: Love making smash burgers and steaks"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed data engineering and DevOps projects at Jarvis for internal users using Java, Python, Docker, Git, PSQL, and Cloud (GCP). Worked in an agile environment with daily scrum meetings and bi-weekly sprint reviews/retrospectives to enhance development processes.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Ansys",
      "description": "Developed Python scripts to support the Electronics Business Unit team in improving APIP analytics engine that processed software usage data, utilizing technologies like PySpark and Azure Databricks. Engineered nested sets tree algorithm, slashing hierarchal user data query time by around 80%.",
      "duration": "2022",
      "title": "Data Science Intern"
    }
  ],
  "skills": {
    "competent": [
      "C",
      "PySpark",
      "Azure Databricks",
      "HTML/CSS",
      "ReactJS",
      "Django",
      "MATLAB",
      "VHDL"
    ],
    "familiar": [
      "AWS",
      "GCP",
      "Jenkins",
      "Terraform",
      "Ansible"
    ],
    "proficient": [
      "Python",
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Docker",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I recently graduated with a Bachelor of Engineering, majoring in Computer Engineering from Toronto Metropolitan University, formerly Ryerson. Throughout my time at Ryerson, I honed my coding, problem-solving, and analytical skills through various courses and projects. I developed a keen interest in data engineering and devops as I delved into topics like algorithms, data structures, operating systems, data engineering and machine learning. This lead me to my data science internship at Ansys, where I was working on big data processing. In my final year, I worked on a full-year capstone project in which I built a full-stack ML job recommender application. I have completed multiple certifications such as IBM Data Science and IBM Applied DevOps Engineering, reflecting my passion for continuous learning and skill enhancement. I consider myself disciplined, highly motivated, and adaptable, thriving both independently and within a team. I enjoy challenges that push my technical and leadership abilities, viewing them as opportunities for growth. Beyond tech, my interests include basketball, strength training, MMA, and cooking. Regularly engaging in these activities keeps me balanced and focused."
}
